10/data/attachments/870a15d1a0963dd0.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Michelle_decision_Friend_14026_4</nif:username>
            <nif:friendToBeRequested>soap_friends_7a7d4e4f-fd83-4257-a088-faddf684ca2d</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>